nbd_fio_results/dev-nbd0_2023-07-17_12:43/seq_w_nbd0_1iodepth/4096.txt
write: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=1
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

write: (groupid=0, jobs=1): err= 0: pid=16906: Mon Jul 17 12:45:50 2023
  write: IOPS=336, BW=1347MiB/s (1412MB/s)(26.3GiB/20002msec)
    slat (usec): min=131, max=3460, avg=1485.51, stdev=371.84
    clat (usec): min=601, max=5153, avg=1470.97, stdev=393.38
     lat (usec): min=2363, max=6496, avg=2967.33, stdev=161.08
    clat percentiles (usec):
     |  1.00th=[  865],  5.00th=[ 1020], 10.00th=[ 1090], 20.00th=[ 1188],
     | 30.00th=[ 1254], 40.00th=[ 1319], 50.00th=[ 1369], 60.00th=[ 1434],
     | 70.00th=[ 1516], 80.00th=[ 1663], 90.00th=[ 2089], 95.00th=[ 2376],
     | 99.00th=[ 2704], 99.50th=[ 2769], 99.90th=[ 2900], 99.95th=[ 2900],
     | 99.99th=[ 5145]
   bw (  MiB/s): min= 1312, max= 1416, per=100.00%, avg=1346.80, stdev=34.59, samples=40
   iops        : min=  328, max=  354, avg=336.70, stdev= 8.65, samples=40
  lat (usec)   : 750=0.19%, 1000=3.88%
  lat (msec)   : 2=84.20%, 4=11.71%, 10=0.01%
  cpu          : usr=2.83%, sys=4.62%, ctx=199508, majf=0, minf=522
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6735,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1347MiB/s (1412MB/s), 1347MiB/s-1347MiB/s (1412MB/s-1412MB/s), io=26.3GiB (28.2GB), run=20002-20002msec

Disk stats (read/write):
  nbd0: ios=0/214279, merge=0/0, ticks=0/245210, in_queue=220829, util=93.47%